{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"training_config": {"metrics": null, "loss_weights": null, "weighted_metrics": null, "loss": ["categorical_crossentropy", "loss"], "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "learning_rate": 0.0010000000474974513, "name": "Adam", "beta_1": 0.8999999761581421, "amsgrad": false}}}, "keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_3", "batch_input_shape": [1, 3, 26], "ragged": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_3"}, {"config": {"dtype": "float32", "sparse": false, "name": "input_4", "batch_input_shape": [1, 3, 1], "ragged": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_4"}, {"config": {"trainable": true, "name": "concatenate_2", "axis": -1, "dtype": "float32"}, "inbound_nodes": [[["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2"}, {"config": {"trainable": true, "layer": {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_5", "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "dtype": "float32", "units": 26, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "class_name": "Dense"}, "name": "time_distributed_2", "dtype": "float32"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_2"}, {"config": {"trainable": true, "layer": {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_6", "activity_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "dtype": "float32", "units": 26, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "class_name": "Dense"}, "name": "time_distributed_3", "dtype": "float32"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_3"}, {"config": {"stateful": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "time_major": false, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "use_bias": true, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_4", "unit_forget_bias": true, "implementation": 2, "dropout": 0.0, "units": 100, "recurrent_activation": "sigmoid", "bias_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "return_state": false}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_4"}, {"config": {"stateful": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "time_major": false, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "use_bias": true, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_5", "unit_forget_bias": true, "implementation": 2, "dropout": 0.0, "units": 100, "recurrent_activation": "sigmoid", "bias_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "return_state": false}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_5"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "name": "dropout_4"}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "name": "dropout_5"}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5"}, {"config": {"stateful": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "time_major": false, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "use_bias": true, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_6", "unit_forget_bias": true, "implementation": 2, "dropout": 0.0, "units": 100, "recurrent_activation": "sigmoid", "bias_regularizer": null, "return_sequences": false, "recurrent_regularizer": null, "return_state": false}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_6"}, {"config": {"stateful": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "time_major": false, "activity_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "use_bias": true, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_7", "unit_forget_bias": true, "implementation": 2, "dropout": 0.0, "units": 100, "recurrent_activation": "sigmoid", "bias_regularizer": null, "return_sequences": false, "recurrent_regularizer": null, "return_state": false}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_7"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "name": "dropout_6"}, "inbound_nodes": [[["lstm_6", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_6"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "name": "dropout_7"}, "inbound_nodes": [[["lstm_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_7"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_7", "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dtype": "float32", "units": 26, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Dense", "name": "dense_7"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_8", "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "dtype": "float32", "units": 4, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Dense", "name": "dense_8"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_9", "activity_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "dtype": "float32", "units": 4, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Dense", "name": "dense_9"}, {"config": {"trainable": true, "name": "reshape_3", "dtype": "float32", "target_shape": [26]}, "inbound_nodes": [[["dense_7", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_3"}, {"config": {"trainable": true, "name": "reshape_4", "dtype": "float32", "target_shape": [4, 1]}, "inbound_nodes": [[["dense_8", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_4"}, {"config": {"trainable": true, "name": "reshape_5", "dtype": "float32", "target_shape": [4, 1]}, "inbound_nodes": [[["dense_9", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_5"}, {"config": {"trainable": true, "name": "activation_1", "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["reshape_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"trainable": true, "name": "concatenate_3", "axis": -1, "dtype": "float32"}, "inbound_nodes": [[["reshape_4", 0, 0, {}], ["reshape_5", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3"}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "name": "functional_3", "output_layers": [["activation_1", 0, 0], ["concatenate_3", 0, 0]]}}}, "weightsManifest": [{"weights": [{"shape": [100, 26], "name": "dense_7/kernel", "dtype": "float32"}, {"shape": [26], "name": "dense_7/bias", "dtype": "float32"}, {"shape": [100, 4], "name": "dense_8/kernel", "dtype": "float32"}, {"shape": [4], "name": "dense_8/bias", "dtype": "float32"}, {"shape": [100, 4], "name": "dense_9/kernel", "dtype": "float32"}, {"shape": [4], "name": "dense_9/bias", "dtype": "float32"}, {"shape": [26, 400], "name": "lstm_4/lstm_cell_4/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_4/lstm_cell_4/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_4/lstm_cell_4/bias", "dtype": "float32"}, {"shape": [26, 400], "name": "lstm_5/lstm_cell_5/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_5/lstm_cell_5/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_5/lstm_cell_5/bias", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_6/lstm_cell_6/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_6/lstm_cell_6/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_6/lstm_cell_6/bias", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_7/lstm_cell_7/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_7/lstm_cell_7/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_7/lstm_cell_7/bias", "dtype": "float32"}, {"shape": [27, 26], "name": "time_distributed_2/kernel", "dtype": "float32"}, {"shape": [26], "name": "time_distributed_2/bias", "dtype": "float32"}, {"shape": [27, 26], "name": "time_distributed_3/kernel", "dtype": "float32"}, {"shape": [26], "name": "time_distributed_3/bias", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}]}