{"convertedBy": "TensorFlow.js Converter v3.3.0", "format": "layers-model", "modelTopology": {"keras_version": "2.4.0", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"ragged": false, "name": "input_1", "batch_input_shape": [1, null, 26], "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"ragged": false, "name": "input_2", "batch_input_shape": [1, null, 1], "dtype": "float32", "sparse": false}}, {"class_name": "LSTM", "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "recurrent_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "bias_constraint": null, "time_major": false, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "name": "lstm", "use_bias": true, "return_sequences": true, "bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "dtype": "float32", "trainable": true, "units": 100, "kernel_regularizer": null, "recurrent_dropout": 0.0, "stateful": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "recurrent_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "bias_constraint": null, "time_major": false, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "name": "lstm_1", "use_bias": true, "return_sequences": true, "bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "dtype": "float32", "trainable": true, "units": 100, "kernel_regularizer": null, "recurrent_dropout": 0.0, "stateful": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]], "config": {"rate": 0.4, "dtype": "float32", "trainable": true, "name": "dropout", "seed": null, "noise_shape": null}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"rate": 0.4, "dtype": "float32", "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Concatenate", "name": "concatenate", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "config": {"name": "concatenate", "axis": -1, "dtype": "float32", "trainable": true}}, {"class_name": "LSTM", "name": "lstm_3", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"kernel_constraint": null, "recurrent_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "bias_constraint": null, "time_major": false, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "name": "lstm_3", "use_bias": true, "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "dtype": "float32", "trainable": true, "units": 100, "kernel_regularizer": null, "recurrent_dropout": 0.0, "stateful": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"kernel_constraint": null, "recurrent_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "bias_constraint": null, "time_major": false, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "name": "lstm_2", "use_bias": true, "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "dtype": "float32", "trainable": true, "units": 100, "kernel_regularizer": null, "recurrent_dropout": 0.0, "stateful": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "config": {"rate": 0.4, "dtype": "float32", "trainable": true, "name": "dropout_3", "seed": null, "noise_shape": null}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"rate": 0.4, "dtype": "float32", "trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 8, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "name": "dense_1", "activation": "linear", "bias_regularizer": null}}, {"class_name": "Dense", "name": "dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 26, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "name": "dense", "activation": "linear", "bias_regularizer": null}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "name": "dense_2", "activation": "softmax", "bias_regularizer": null}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "name": "dense_3", "activation": "sigmoid", "bias_regularizer": null}}, {"class_name": "Reshape", "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [26]}}, {"class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [4, 1]}}, {"class_name": "Reshape", "name": "reshape_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [4, 1]}}, {"class_name": "Activation", "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"name": "activation", "activation": "softmax", "dtype": "float32", "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "dtype": "float32", "trainable": true}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}, "training_config": {"weighted_metrics": null, "loss": ["categorical_crossentropy", "loss"], "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "amsgrad": false, "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421}}, "metrics": null, "loss_weights": null}, "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"name": "dense/kernel", "shape": [100, 26], "dtype": "float32"}, {"name": "dense/bias", "shape": [26], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [100, 8], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [4], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [26, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [1, 400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/kernel", "shape": [200, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/kernel", "shape": [200, 400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/bias", "shape": [400], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "generatedBy": "keras v2.4.0"}