{"format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.3.0", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "name": "dense/kernel", "shape": [100, 26]}, {"dtype": "float32", "name": "dense/bias", "shape": [26]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [100, 17]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [17]}, {"dtype": "float32", "name": "lstm/lstm_cell/kernel", "shape": [26, 400]}, {"dtype": "float32", "name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm/lstm_cell/bias", "shape": [400]}, {"dtype": "float32", "name": "lstm_1/lstm_cell_1/kernel", "shape": [17, 400]}, {"dtype": "float32", "name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm_1/lstm_cell_1/bias", "shape": [400]}, {"dtype": "float32", "name": "lstm_2/lstm_cell_2/kernel", "shape": [200, 400]}, {"dtype": "float32", "name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm_2/lstm_cell_2/bias", "shape": [400]}, {"dtype": "float32", "name": "lstm_3/lstm_cell_3/kernel", "shape": [200, 400]}, {"dtype": "float32", "name": "lstm_3/lstm_cell_3/recurrent_kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm_3/lstm_cell_3/bias", "shape": [400]}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.4.0", "training_config": {"loss": ["categorical_crossentropy", "categorical_crossentropy"], "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "name": "Adam", "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}, "metrics": null, "loss_weights": null, "weighted_metrics": null}, "model_config": {"class_name": "Functional", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "ragged": false, "name": "input_1", "sparse": false, "batch_input_shape": [1, null, 26]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "ragged": false, "name": "input_2", "sparse": false, "batch_input_shape": [1, null, 17]}, "name": "input_2", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "return_state": false, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "name": "lstm", "activation": "tanh", "time_major": false, "return_sequences": true, "use_bias": true, "dtype": "float32", "units": 100, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "go_backwards": false, "stateful": true, "kernel_constraint": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false}, "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "return_state": false, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "activation": "tanh", "time_major": false, "return_sequences": true, "use_bias": true, "dtype": "float32", "units": 100, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "go_backwards": false, "stateful": true, "kernel_constraint": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false}, "name": "lstm_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "name": "dropout", "rate": 0.4, "seed": null, "noise_shape": null}, "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "name": "dropout_1", "rate": 0.4, "seed": null, "noise_shape": null}, "name": "dropout_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "dtype": "float32", "name": "concatenate", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "return_state": false, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_2", "activation": "tanh", "time_major": false, "return_sequences": false, "use_bias": true, "dtype": "float32", "units": 100, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "go_backwards": false, "stateful": true, "kernel_constraint": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false}, "name": "lstm_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_regularizer": null, "return_state": false, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_3", "activation": "tanh", "time_major": false, "return_sequences": false, "use_bias": true, "dtype": "float32", "units": 100, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "go_backwards": false, "stateful": true, "kernel_constraint": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false}, "name": "lstm_3", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "name": "dropout_2", "rate": 0.4, "seed": null, "noise_shape": null}, "name": "dropout_2", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "name": "dropout_3", "rate": 0.4, "seed": null, "noise_shape": null}, "name": "dropout_3", "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "units": 26, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense", "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "units": 17, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "dtype": "float32", "name": "reshape", "target_shape": [26]}, "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "dtype": "float32", "name": "reshape_1", "target_shape": [17]}, "name": "reshape_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "dtype": "float32", "name": "activation"}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "dtype": "float32", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}], "output_layers": [["activation", 0, 0], ["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "functional_1"}}}, "generatedBy": "keras v2.4.0"}