{"format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.3.0", "weightsManifest": [{"weights": [{"name": "dense/kernel", "shape": [100, 26], "dtype": "float32"}, {"name": "dense/bias", "shape": [26], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [25, 8], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [4], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [26, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [1, 100], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [25, 100], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [100], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/kernel", "shape": [125, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/kernel", "shape": [125, 100], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/recurrent_kernel", "shape": [25, 100], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/bias", "shape": [100], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "generatedBy": "keras v2.4.0", "modelTopology": {"training_config": {"metrics": null, "loss": ["categorical_crossentropy", "loss"], "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "decay": 0.0}}, "weighted_metrics": null}, "keras_version": "2.4.0", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"ragged": false, "batch_input_shape": [1, null, 26], "name": "input_1", "sparse": false, "dtype": "float32"}, "name": "input_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"ragged": false, "batch_input_shape": [1, null, 1], "name": "input_2", "sparse": false, "dtype": "float32"}, "name": "input_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "return_state": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "bias_constraint": null, "use_bias": true, "name": "lstm", "implementation": 2, "unroll": false, "units": 100, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "return_sequences": true, "time_major": false, "activation": "tanh", "recurrent_regularizer": null, "stateful": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null}, "name": "lstm"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "return_state": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "bias_constraint": null, "use_bias": true, "name": "lstm_1", "implementation": 2, "unroll": false, "units": 25, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "return_sequences": true, "time_major": false, "activation": "tanh", "recurrent_regularizer": null, "stateful": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null}, "name": "lstm_1"}, {"inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout", "dtype": "float32", "seed": null, "rate": 0.4, "trainable": true, "noise_shape": null}, "name": "dropout"}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "seed": null, "rate": 0.4, "trainable": true, "noise_shape": null}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate", "axis": -1, "dtype": "float32", "trainable": true}, "name": "concatenate"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "return_state": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "bias_constraint": null, "use_bias": true, "name": "lstm_3", "implementation": 2, "unroll": false, "units": 25, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "return_sequences": false, "time_major": false, "activation": "tanh", "recurrent_regularizer": null, "stateful": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null}, "name": "lstm_3"}, {"inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_3", "dtype": "float32", "seed": null, "rate": 0.4, "trainable": true, "noise_shape": null}, "name": "dropout_3"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "return_state": false, "dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "bias_constraint": null, "use_bias": true, "name": "lstm_2", "implementation": 2, "unroll": false, "units": 100, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "return_sequences": false, "time_major": false, "activation": "tanh", "recurrent_regularizer": null, "stateful": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null}, "name": "lstm_2"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true, "use_bias": true, "name": "dense_1", "units": 8, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "name": "dense_1"}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_2", "dtype": "float32", "seed": null, "rate": 0.4, "trainable": true, "noise_shape": null}, "name": "dropout_2"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_4", "dtype": "float32", "seed": null, "rate": 0.4, "trainable": true, "noise_shape": null}, "name": "dropout_4"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true, "use_bias": true, "name": "dense", "units": 26, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "name": "dense"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "trainable": true, "use_bias": true, "name": "dense_2", "units": 4, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "name": "dense_2"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "trainable": true, "use_bias": true, "name": "dense_3", "units": 4, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "name": "dense_3"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape", "target_shape": [26], "dtype": "float32", "trainable": true}, "name": "reshape"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [4, 1], "dtype": "float32", "trainable": true}, "name": "reshape_1"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_2", "target_shape": [4, 1], "dtype": "float32", "trainable": true}, "name": "reshape_2"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "dtype": "float32", "trainable": true}, "name": "concatenate_1"}]}}, "backend": "tensorflow"}}