{"modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "output_layers": [["activation", 0, 0], ["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "ragged": false, "batch_input_shape": [1, null, 26], "sparse": false, "dtype": "float32"}}, {"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_2", "ragged": false, "batch_input_shape": [1, null, 17], "sparse": false, "dtype": "float32"}}, {"name": "lstm", "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "tanh", "kernel_constraint": null, "units": 100, "name": "lstm", "go_backwards": false, "time_major": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "return_state": false, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "use_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "implementation": 2}}, {"name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"activation": "tanh", "kernel_constraint": null, "units": 100, "name": "lstm_1", "go_backwards": false, "time_major": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "return_state": false, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "use_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "implementation": 2}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout", "rate": 0.4, "dtype": "float32", "noise_shape": null}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.4, "dtype": "float32", "noise_shape": null}}, {"name": "concatenate", "class_name": "Concatenate", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "config": {"name": "concatenate", "dtype": "float32", "axis": -1, "trainable": true}}, {"name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"activation": "tanh", "kernel_constraint": null, "units": 100, "name": "lstm_2", "go_backwards": false, "time_major": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "return_state": false, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "use_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "implementation": 2}}, {"name": "lstm_3", "class_name": "LSTM", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"activation": "tanh", "kernel_constraint": null, "units": 100, "name": "lstm_3", "go_backwards": false, "time_major": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "return_state": false, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "dtype": "float32", "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "use_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "implementation": 2}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.4, "dtype": "float32", "noise_shape": null}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_3", "rate": 0.4, "dtype": "float32", "noise_shape": null}}, {"name": "dense", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "units": 26, "trainable": true, "name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "units": 17, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"name": "reshape", "dtype": "float32", "target_shape": [26], "trainable": true}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "reshape_1", "dtype": "float32", "target_shape": [17], "trainable": true}}, {"name": "activation", "class_name": "Activation", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"name": "activation", "activation": "softmax", "dtype": "float32", "trainable": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "softmax", "dtype": "float32", "trainable": true}}]}}, "training_config": {"loss": ["categorical_crossentropy", "categorical_crossentropy"], "loss_weights": null, "weighted_metrics": null, "metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "name": "Adam", "learning_rate": 0.0010000000474974513, "amsgrad": false, "beta_1": 0.8999999761581421}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [100, 26], "dtype": "float32"}, {"name": "dense/bias", "shape": [26], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [100, 17], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [17], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [26, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [17, 400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/kernel", "shape": [200, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/kernel", "shape": [200, 400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/bias", "shape": [400], "dtype": "float32"}]}], "convertedBy": "TensorFlow.js Converter v3.3.0", "format": "layers-model", "generatedBy": "keras v2.4.0"}