{"generatedBy": "keras v2.4.0", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "dtype": "float32", "shape": [100, 26]}, {"name": "dense/bias", "dtype": "float32", "shape": [26]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [25, 8]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [8]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [8, 4]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [4]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [8, 4]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [4]}, {"name": "lstm/lstm_cell/kernel", "dtype": "float32", "shape": [26, 400]}, {"name": "lstm/lstm_cell/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm/lstm_cell/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_1/lstm_cell_1/kernel", "dtype": "float32", "shape": [1, 100]}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "dtype": "float32", "shape": [25, 100]}, {"name": "lstm_1/lstm_cell_1/bias", "dtype": "float32", "shape": [100]}, {"name": "lstm_2/lstm_cell_2/kernel", "dtype": "float32", "shape": [125, 400]}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_2/lstm_cell_2/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_3/lstm_cell_3/kernel", "dtype": "float32", "shape": [125, 100]}, {"name": "lstm_3/lstm_cell_3/recurrent_kernel", "dtype": "float32", "shape": [25, 100]}, {"name": "lstm_3/lstm_cell_3/bias", "dtype": "float32", "shape": [100]}]}], "modelTopology": {"backend": "tensorflow", "training_config": {"loss_weights": null, "loss": ["categorical_crossentropy", "loss"], "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "epsilon": 1e-07, "name": "Adam", "decay": 0.0, "amsgrad": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421}}, "metrics": null}, "keras_version": "2.4.0", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [1, null, 26], "dtype": "float32", "ragged": false, "name": "input_1"}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [1, null, 1], "dtype": "float32", "ragged": false, "name": "input_2"}}, {"class_name": "LSTM", "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"return_sequences": true, "return_state": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_regularizer": null, "name": "lstm", "bias_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "time_major": false, "stateful": true, "implementation": 2, "recurrent_activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "trainable": true, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "units": 100, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "kernel_constraint": null, "activation": "tanh"}}, {"class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"return_sequences": true, "return_state": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_regularizer": null, "name": "lstm_1", "bias_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "time_major": false, "stateful": true, "implementation": 2, "recurrent_activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "trainable": true, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "units": 25, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "kernel_constraint": null, "activation": "tanh"}}, {"class_name": "Dropout", "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout", "dtype": "float32", "rate": 0.4}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "dtype": "float32", "rate": 0.4}}, {"class_name": "Concatenate", "name": "concatenate", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}}, {"class_name": "LSTM", "name": "lstm_3", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"return_sequences": false, "return_state": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_regularizer": null, "name": "lstm_3", "bias_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "time_major": false, "stateful": true, "implementation": 2, "recurrent_activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "trainable": true, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "units": 25, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "kernel_constraint": null, "activation": "tanh"}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3", "dtype": "float32", "rate": 0.4}}, {"class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"return_sequences": false, "return_state": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_regularizer": null, "name": "lstm_2", "bias_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "time_major": false, "stateful": true, "implementation": 2, "recurrent_activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "trainable": true, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "dropout": 0.0, "units": 100, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "kernel_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "units": 8, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "dtype": "float32", "rate": 0.4}}, {"class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_4", "dtype": "float32", "rate": 0.4}}, {"class_name": "Dense", "name": "dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "units": 26, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "units": 4, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "units": 4, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Reshape", "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [26]}}, {"class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [4, 1]}}, {"class_name": "Reshape", "name": "reshape_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [4, 1]}}, {"class_name": "Activation", "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "softmax"}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}}], "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.3.0"}