{"format": "layers-model", "generatedBy": "keras v2.4.0", "modelTopology": {"training_config": {"loss": ["categorical_crossentropy", "mean_squared_error"], "loss_weights": null, "weighted_metrics": null, "metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "learning_rate": 0.0010000000474974513, "beta_2": 0.9990000128746033, "name": "Adam"}}}, "backend": "tensorflow", "keras_version": "2.4.0", "model_config": {"class_name": "Functional", "config": {"output_layers": [["activation", 0, 0], ["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "functional_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [1, null, 26], "ragged": false, "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [1, null, 1], "ragged": false, "sparse": false, "name": "input_2"}, "name": "input_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "bias_constraint": null, "unroll": false, "time_major": false, "return_state": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "stateful": true, "trainable": true, "recurrent_constraint": null, "name": "lstm", "implementation": 2, "activity_regularizer": null, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "units": 100}, "name": "lstm"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "bias_constraint": null, "unroll": false, "time_major": false, "return_state": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "stateful": true, "trainable": true, "recurrent_constraint": null, "name": "lstm_1", "implementation": 2, "activity_regularizer": null, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "units": 25}, "name": "lstm_1"}, {"inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout"}, "name": "dropout"}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"dtype": "float32", "trainable": true, "name": "concatenate", "axis": -1}, "name": "concatenate"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "bias_constraint": null, "unroll": false, "time_major": false, "return_state": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "stateful": true, "trainable": true, "recurrent_constraint": null, "name": "lstm_2", "implementation": 2, "activity_regularizer": null, "return_sequences": false, "kernel_constraint": null, "bias_regularizer": null, "units": 100}, "name": "lstm_2"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"dtype": "float32", "trainable": true, "name": "time_distributed", "layer": {"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "activation": "tanh", "bias_constraint": null, "trainable": true, "name": "dense", "activity_regularizer": null, "units": 25, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}}, "name": "time_distributed"}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"inbound_nodes": [[["time_distributed", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "activation": "linear", "bias_constraint": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "units": 26, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "bias_constraint": null, "unroll": false, "time_major": false, "return_state": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "stateful": true, "trainable": true, "recurrent_constraint": null, "name": "lstm_3", "implementation": 2, "activity_regularizer": null, "return_sequences": false, "kernel_constraint": null, "bias_regularizer": null, "units": 25}, "name": "lstm_3"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Reshape", "config": {"dtype": "float32", "target_shape": [26], "trainable": true, "name": "reshape"}, "name": "reshape"}, {"inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation", "activation": "softmax"}, "name": "activation"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_2"}]}}}, "convertedBy": "TensorFlow.js Converter v3.3.0", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [100, 26], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [26], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [25, 1], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [26, 400], "name": "lstm/lstm_cell/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm/lstm_cell/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm/lstm_cell/bias"}, {"dtype": "float32", "shape": [1, 100], "name": "lstm_1/lstm_cell_1/kernel"}, {"dtype": "float32", "shape": [25, 100], "name": "lstm_1/lstm_cell_1/recurrent_kernel"}, {"dtype": "float32", "shape": [100], "name": "lstm_1/lstm_cell_1/bias"}, {"dtype": "float32", "shape": [125, 400], "name": "lstm_2/lstm_cell_2/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_2/lstm_cell_2/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_2/lstm_cell_2/bias"}, {"dtype": "float32", "shape": [50, 100], "name": "lstm_3/lstm_cell_3/kernel"}, {"dtype": "float32", "shape": [25, 100], "name": "lstm_3/lstm_cell_3/recurrent_kernel"}, {"dtype": "float32", "shape": [100], "name": "lstm_3/lstm_cell_3/bias"}, {"dtype": "float32", "shape": [100, 25], "name": "time_distributed/kernel"}, {"dtype": "float32", "shape": [25], "name": "time_distributed/bias"}], "paths": ["group1-shard1of1.bin"]}]}