{"generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [200, 26], "name": "dense/kernel"}, {"dtype": "float32", "shape": [26], "name": "dense/bias"}, {"dtype": "float32", "shape": [200, 8], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [8], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [8, 4], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [8, 4], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [26, 400], "name": "lstm/lstm_cell/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm/lstm_cell/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm/lstm_cell/bias"}, {"dtype": "float32", "shape": [1, 400], "name": "lstm_1/lstm_cell_1/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_1/lstm_cell_1/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_1/lstm_cell_1/bias"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_2/lstm_cell_2/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_2/lstm_cell_2/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_2/lstm_cell_2/bias"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_3/lstm_cell_3/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_3/lstm_cell_3/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_3/lstm_cell_3/bias"}], "paths": ["group1-shard1of1.bin"]}], "format": "layers-model", "modelTopology": {"model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "ragged": false, "batch_input_shape": [1, 3, 26], "sparse": false}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "ragged": false, "batch_input_shape": [1, 3, 1], "sparse": false}}, {"class_name": "LSTM", "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"return_sequences": true, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "implementation": 2, "recurrent_activation": "sigmoid", "name": "lstm", "units": 100, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "return_state": false, "dtype": "float32", "time_major": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"return_sequences": true, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "implementation": 2, "recurrent_activation": "sigmoid", "name": "lstm_1", "units": 100, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "return_state": false, "dtype": "float32", "time_major": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "unroll": false}}, {"class_name": "Dropout", "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]], "config": {"seed": null, "name": "dropout", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.2}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"return_sequences": false, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "implementation": 2, "recurrent_activation": "sigmoid", "name": "lstm_2", "units": 100, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "return_state": false, "dtype": "float32", "time_major": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "unroll": false}}, {"class_name": "LSTM", "name": "lstm_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"return_sequences": false, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "implementation": 2, "recurrent_activation": "sigmoid", "name": "lstm_3", "units": 100, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "return_state": false, "dtype": "float32", "time_major": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "unroll": false}}, {"class_name": "Concatenate", "name": "concatenate", "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "concatenate"}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_3", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.2}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_2", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "units": 8, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dense", "name": "dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "name": "dense", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "units": 26, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "name": "dense_2", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "softmax", "units": 4, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "name": "dense_3", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "sigmoid", "units": 4, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Reshape", "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "reshape", "target_shape": [26]}}, {"class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "reshape_1", "target_shape": [4, 1]}}, {"class_name": "Reshape", "name": "reshape_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "reshape_2", "target_shape": [4, 1]}}, {"class_name": "Activation", "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation", "activation": "softmax"}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "concatenate_1"}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "learning_rate": 0.0010000000474974513, "epsilon": 1e-07, "decay": 0.0, "beta_2": 0.9990000128746033, "name": "Adam", "beta_1": 0.8999999761581421}}, "metrics": null, "loss_weights": null, "weighted_metrics": null, "loss": ["categorical_crossentropy", "loss"]}, "keras_version": "2.4.0", "backend": "tensorflow"}}