{"format": "layers-model", "generatedBy": "keras v2.4.0", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [200, 26], "name": "dense/kernel"}, {"dtype": "float32", "shape": [26], "name": "dense/bias"}, {"dtype": "float32", "shape": [200, 8], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [8], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [8, 4], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [8, 4], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [26, 400], "name": "lstm/lstm_cell/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm/lstm_cell/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm/lstm_cell/bias"}, {"dtype": "float32", "shape": [1, 400], "name": "lstm_1/lstm_cell_1/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_1/lstm_cell_1/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_1/lstm_cell_1/bias"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_2/lstm_cell_2/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_2/lstm_cell_2/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_2/lstm_cell_2/bias"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_3/lstm_cell_3/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_3/lstm_cell_3/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_3/lstm_cell_3/bias"}]}], "modelTopology": {"training_config": {"metrics": null, "loss_weights": null, "loss": ["categorical_crossentropy", "loss"], "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "learning_rate": 0.0010000000474974513, "amsgrad": false, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "weighted_metrics": null}, "model_config": {"config": {"layers": [{"name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [1, 3, 26], "name": "input_1", "ragged": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_2", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [1, 3, 1], "name": "input_2", "ragged": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "lstm", "config": {"units": 100, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 2, "return_state": false, "trainable": true, "time_major": false, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_activation": "sigmoid", "activity_regularizer": null, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": true, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0}, "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"units": 100, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 2, "return_state": false, "trainable": true, "time_major": false, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_activation": "sigmoid", "activity_regularizer": null, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": true, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0}, "class_name": "LSTM", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "dtype": "float32", "name": "dropout", "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "dtype": "float32", "name": "dropout_1", "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "lstm_2", "config": {"units": 100, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 2, "return_state": false, "trainable": true, "time_major": false, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_activation": "sigmoid", "activity_regularizer": null, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": false, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0}, "class_name": "LSTM", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "lstm_3", "config": {"units": 100, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_3", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 2, "return_state": false, "trainable": true, "time_major": false, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_activation": "sigmoid", "activity_regularizer": null, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": false, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0}, "class_name": "LSTM", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "concatenate", "config": {"dtype": "float32", "trainable": true, "name": "concatenate", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_3", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "dtype": "float32", "name": "dropout_3", "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "dtype": "float32", "name": "dropout_2", "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "dense_1", "config": {"units": 8, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "name": "dense_1", "activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dense", "config": {"units": 26, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "name": "dense", "activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_2", "config": {"units": 4, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "name": "dense_2", "activation": "softmax", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"units": 4, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "name": "dense_3", "activation": "sigmoid", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "reshape", "config": {"dtype": "float32", "trainable": true, "name": "reshape", "target_shape": [26]}, "class_name": "Reshape", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "reshape_1", "config": {"dtype": "float32", "trainable": true, "name": "reshape_1", "target_shape": [4, 1]}, "class_name": "Reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "reshape_2", "config": {"dtype": "float32", "trainable": true, "name": "reshape_2", "target_shape": [4, 1]}, "class_name": "Reshape", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "activation", "config": {"dtype": "float32", "trainable": true, "name": "activation", "activation": "softmax"}, "class_name": "Activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]]}], "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]], "name": "functional_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Functional"}, "backend": "tensorflow", "keras_version": "2.4.0"}, "convertedBy": "TensorFlow.js Converter v3.3.0"}