{"weightsManifest": [{"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [100, 26]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [26]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [100, 9]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [9]}, {"name": "lstm_4/lstm_cell_4/kernel", "dtype": "float32", "shape": [26, 400]}, {"name": "lstm_4/lstm_cell_4/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_4/lstm_cell_4/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_5/lstm_cell_5/kernel", "dtype": "float32", "shape": [9, 400]}, {"name": "lstm_5/lstm_cell_5/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_5/lstm_cell_5/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_6/lstm_cell_6/kernel", "dtype": "float32", "shape": [200, 400]}, {"name": "lstm_6/lstm_cell_6/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_6/lstm_cell_6/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_7/lstm_cell_7/kernel", "dtype": "float32", "shape": [200, 400]}, {"name": "lstm_7/lstm_cell_7/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_7/lstm_cell_7/bias", "dtype": "float32", "shape": [400]}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_3", "batch_input_shape": [1, null, 26], "sparse": false, "dtype": "float32", "ragged": false}}, {"name": "input_4", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_4", "batch_input_shape": [1, null, 9], "sparse": false, "dtype": "float32", "ragged": false}}, {"name": "lstm_4", "class_name": "LSTM", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"return_state": false, "dtype": "float32", "units": 100, "name": "lstm_4", "time_major": false, "kernel_constraint": null, "go_backwards": false, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 2, "stateful": true, "recurrent_activation": "sigmoid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_sequences": true, "bias_regularizer": null, "recurrent_dropout": 0.0}}, {"name": "lstm_5", "class_name": "LSTM", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"return_state": false, "dtype": "float32", "units": 100, "name": "lstm_5", "time_major": false, "kernel_constraint": null, "go_backwards": false, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 2, "stateful": true, "recurrent_activation": "sigmoid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_sequences": true, "bias_regularizer": null, "recurrent_dropout": 0.0}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["lstm_4", 0, 0, {}]]], "config": {"seed": null, "dtype": "float32", "noise_shape": null, "rate": 0.4, "name": "dropout_4", "trainable": true}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["lstm_5", 0, 0, {}]]], "config": {"seed": null, "dtype": "float32", "noise_shape": null, "rate": 0.4, "name": "dropout_5", "trainable": true}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["dropout_4", 0, 0, {}], ["dropout_5", 0, 0, {}]]], "config": {"name": "concatenate_1", "dtype": "float32", "trainable": true, "axis": -1}}, {"name": "lstm_6", "class_name": "LSTM", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"return_state": false, "dtype": "float32", "units": 100, "name": "lstm_6", "time_major": false, "kernel_constraint": null, "go_backwards": false, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 2, "stateful": true, "recurrent_activation": "sigmoid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_sequences": false, "bias_regularizer": null, "recurrent_dropout": 0.0}}, {"name": "lstm_7", "class_name": "LSTM", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"return_state": false, "dtype": "float32", "units": 100, "name": "lstm_7", "time_major": false, "kernel_constraint": null, "go_backwards": false, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 2, "stateful": true, "recurrent_activation": "sigmoid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_sequences": false, "bias_regularizer": null, "recurrent_dropout": 0.0}}, {"name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["lstm_6", 0, 0, {}]]], "config": {"seed": null, "dtype": "float32", "noise_shape": null, "rate": 0.4, "name": "dropout_6", "trainable": true}}, {"name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["lstm_7", 0, 0, {}]]], "config": {"seed": null, "dtype": "float32", "noise_shape": null, "rate": 0.4, "name": "dropout_7", "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"dtype": "float32", "kernel_regularizer": null, "units": 26, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"dtype": "float32", "kernel_regularizer": null, "units": 9, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}}, {"name": "reshape_2", "class_name": "Reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "reshape_2", "dtype": "float32", "trainable": true, "target_shape": [26]}}, {"name": "reshape_3", "class_name": "Reshape", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "reshape_3", "dtype": "float32", "trainable": true, "target_shape": [9]}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "config": {"name": "activation_2", "dtype": "float32", "activation": "softmax", "trainable": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["reshape_3", 0, 0, {}]]], "config": {"name": "activation_3", "dtype": "float32", "activation": "softmax", "trainable": true}}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["activation_2", 0, 0], ["activation_3", 0, 0]]}}, "keras_version": "2.4.0", "training_config": {"loss": ["categorical_crossentropy", "categorical_crossentropy"], "weighted_metrics": null, "loss_weights": null, "metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "beta_2": 0.9990000128746033, "name": "Adam", "epsilon": 1e-07, "decay": 0.0, "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421}}}}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.3.0", "generatedBy": "keras v2.4.0"}