{"generatedBy": "keras v2.4.0", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [100, 26], "name": "dense/kernel"}, {"dtype": "float32", "shape": [26], "name": "dense/bias"}, {"dtype": "float32", "shape": [100, 17], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [17], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [26, 400], "name": "lstm/lstm_cell/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm/lstm_cell/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm/lstm_cell/bias"}, {"dtype": "float32", "shape": [17, 400], "name": "lstm_1/lstm_cell_1/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_1/lstm_cell_1/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_1/lstm_cell_1/bias"}, {"dtype": "float32", "shape": [200, 400], "name": "lstm_2/lstm_cell_2/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_2/lstm_cell_2/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_2/lstm_cell_2/bias"}, {"dtype": "float32", "shape": [200, 400], "name": "lstm_3/lstm_cell_3/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "lstm_3/lstm_cell_3/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "lstm_3/lstm_cell_3/bias"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"keras_version": "2.4.0", "model_config": {"class_name": "Functional", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation", 0, 0], ["activation_1", 0, 0]], "name": "functional_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [1, null, 26], "ragged": false, "sparse": false}, "name": "input_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [1, null, 17], "ragged": false, "sparse": false}, "name": "input_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_constraint": null, "unroll": false, "use_bias": true, "go_backwards": false, "stateful": true, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_activation": "sigmoid", "implementation": 2, "units": 100, "name": "lstm", "time_major": false, "return_sequences": true, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "recurrent_dropout": 0.0, "dtype": "float32", "trainable": true}, "name": "lstm"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_constraint": null, "unroll": false, "use_bias": true, "go_backwards": false, "stateful": true, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_activation": "sigmoid", "implementation": 2, "units": 100, "name": "lstm_1", "time_major": false, "return_sequences": true, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "recurrent_dropout": 0.0, "dtype": "float32", "trainable": true}, "name": "lstm_1"}, {"inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout"}, "name": "dropout"}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"dtype": "float32", "trainable": true, "name": "concatenate", "axis": -1}, "name": "concatenate"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_constraint": null, "unroll": false, "use_bias": true, "go_backwards": false, "stateful": true, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_activation": "sigmoid", "implementation": 2, "units": 100, "name": "lstm_2", "time_major": false, "return_sequences": false, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "recurrent_dropout": 0.0, "dtype": "float32", "trainable": true}, "name": "lstm_2"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_constraint": null, "unroll": false, "use_bias": true, "go_backwards": false, "stateful": true, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_activation": "sigmoid", "implementation": 2, "units": 100, "name": "lstm_3", "time_major": false, "return_sequences": false, "recurrent_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "recurrent_dropout": 0.0, "dtype": "float32", "trainable": true}, "name": "lstm_3"}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 26, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "name": "dense"}, "name": "dense"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 17, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "name": "dense_1"}, "name": "dense_1"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape", "config": {"target_shape": [26], "dtype": "float32", "trainable": true, "name": "reshape"}, "name": "reshape"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Reshape", "config": {"target_shape": [17], "dtype": "float32", "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "softmax", "dtype": "float32", "trainable": true, "name": "activation"}, "name": "activation"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "softmax", "dtype": "float32", "trainable": true, "name": "activation_1"}, "name": "activation_1"}]}}, "backend": "tensorflow", "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "beta_2": 0.9990000128746033}}, "loss_weights": null, "loss": ["categorical_crossentropy", "categorical_crossentropy"], "weighted_metrics": null, "metrics": null}}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.3.0"}