{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "dtype": "float32", "shape": [100, 26]}, {"name": "dense/bias", "dtype": "float32", "shape": [26]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [100, 8]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [8]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [8, 4]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [4]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [8, 4]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [4]}, {"name": "lstm/lstm_cell_4/kernel", "dtype": "float32", "shape": [26, 400]}, {"name": "lstm/lstm_cell_4/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm/lstm_cell_4/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_1/lstm_cell_5/kernel", "dtype": "float32", "shape": [1, 400]}, {"name": "lstm_1/lstm_cell_5/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_1/lstm_cell_5/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_2/lstm_cell_7/kernel", "dtype": "float32", "shape": [200, 400]}, {"name": "lstm_2/lstm_cell_7/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_2/lstm_cell_7/bias", "dtype": "float32", "shape": [400]}, {"name": "lstm_3/lstm_cell_6/kernel", "dtype": "float32", "shape": [200, 400]}, {"name": "lstm_3/lstm_cell_6/recurrent_kernel", "dtype": "float32", "shape": [100, 400]}, {"name": "lstm_3/lstm_cell_6/bias", "dtype": "float32", "shape": [400]}]}], "modelTopology": {"model_config": {"config": {"name": "functional_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]], "layers": [{"config": {"name": "input_1", "dtype": "float32", "sparse": false, "ragged": false, "batch_input_shape": [1, null, 26]}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "input_2", "dtype": "float32", "sparse": false, "ragged": false, "batch_input_shape": [1, null, 1]}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"unroll": false, "dtype": "float32", "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "units": 100, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "time_major": false, "implementation": 2, "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null, "name": "lstm", "return_state": false, "stateful": true, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM"}, {"config": {"unroll": false, "dtype": "float32", "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "units": 100, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "time_major": false, "implementation": 2, "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null, "name": "lstm_1", "return_state": false, "stateful": true, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "name": "lstm_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "LSTM"}, {"config": {"name": "dropout", "dtype": "float32", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"name": "concatenate", "dtype": "float32", "axis": -1, "trainable": true}, "name": "concatenate", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"unroll": false, "dtype": "float32", "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "units": 100, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "return_sequences": false, "kernel_constraint": null, "time_major": false, "implementation": 2, "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null, "name": "lstm_3", "return_state": false, "stateful": true, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "name": "lstm_3", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM"}, {"config": {"unroll": false, "dtype": "float32", "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "units": 100, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "return_sequences": false, "kernel_constraint": null, "time_major": false, "implementation": 2, "dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null, "name": "lstm_2", "return_state": false, "stateful": true, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "name": "lstm_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM"}, {"config": {"name": "dropout_3", "dtype": "float32", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "linear", "units": 8, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "use_bias": true}, "name": "dense_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "linear", "units": 26, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense", "kernel_regularizer": null, "use_bias": true}, "name": "dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "softmax", "units": 4, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": null, "use_bias": true}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "units": 4, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_regularizer": null, "use_bias": true}, "name": "dense_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "reshape", "dtype": "float32", "target_shape": [26], "trainable": true}, "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"name": "reshape_1", "dtype": "float32", "target_shape": [4, 1], "trainable": true}, "name": "reshape_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"name": "reshape_2", "dtype": "float32", "target_shape": [4, 1], "trainable": true}, "name": "reshape_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"name": "activation", "activation": "softmax", "dtype": "float32", "trainable": true}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "concatenate_1", "dtype": "float32", "axis": -1, "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "class_name": "Concatenate"}]}, "class_name": "Functional"}, "keras_version": "2.4.0", "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v3.3.0", "format": "layers-model", "generatedBy": "keras v2.4.0"}