{"convertedBy": "TensorFlow.js Converter v3.3.0", "format": "layers-model", "generatedBy": "keras v2.4.0", "modelTopology": {"model_config": {"config": {"name": "functional_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "ragged": false, "batch_input_shape": [1, null, 26]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_2", "config": {"name": "input_2", "dtype": "float32", "sparse": false, "ragged": false, "batch_input_shape": [1, null, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "lstm", "config": {"recurrent_constraint": null, "return_state": false, "activation": "tanh", "implementation": 2, "return_sequences": true, "trainable": true, "name": "lstm", "dropout": 0.0, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "unroll": false, "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_regularizer": null, "time_major": false, "go_backwards": false, "dtype": "float32", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "lstm_1", "config": {"recurrent_constraint": null, "return_state": false, "activation": "tanh", "implementation": 2, "return_sequences": true, "trainable": true, "name": "lstm_1", "dropout": 0.0, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "unroll": false, "units": 25, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_regularizer": null, "time_major": false, "go_backwards": false, "dtype": "float32", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout", "config": {"name": "dropout", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}, "inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dropout_1", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "concatenate", "config": {"name": "concatenate", "dtype": "float32", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "lstm_3", "config": {"recurrent_constraint": null, "return_state": false, "activation": "tanh", "implementation": 2, "return_sequences": false, "trainable": true, "name": "lstm_3", "dropout": 0.0, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "unroll": false, "units": 25, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_regularizer": null, "time_major": false, "go_backwards": false, "dtype": "float32", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_3", "config": {"name": "dropout_3", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "lstm_2", "config": {"recurrent_constraint": null, "return_state": false, "activation": "tanh", "implementation": 2, "return_sequences": false, "trainable": true, "name": "lstm_2", "dropout": 0.0, "stateful": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "unroll": false, "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_regularizer": null, "time_major": false, "go_backwards": false, "dtype": "float32", "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "sigmoid", "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["concatenate", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dense_1", "config": {"units": 8, "name": "dense_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dropout_4", "config": {"name": "dropout_4", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense", "config": {"units": 26, "name": "dense", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"units": 4, "name": "dense_2", "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"units": 4, "name": "dense_3", "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "reshape", "config": {"name": "reshape", "target_shape": [26], "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "reshape_1", "config": {"name": "reshape_1", "target_shape": [4, 1], "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "reshape_2", "config": {"name": "reshape_2", "target_shape": [4, 1], "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "activation", "config": {"name": "activation", "dtype": "float32", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "dtype": "float32", "trainable": true, "axis": -1}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "class_name": "Concatenate"}], "output_layers": [["activation", 0, 0], ["concatenate_1", 0, 0]]}, "class_name": "Functional"}, "keras_version": "2.4.0", "training_config": {"loss_weights": null, "loss": ["categorical_crossentropy", "loss"], "weighted_metrics": null, "optimizer_config": {"config": {"name": "Adam", "epsilon": 1e-07, "decay": 0.0, "learning_rate": 0.0010000000474974513, "amsgrad": false, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "metrics": null}, "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"name": "dense/kernel", "shape": [100, 26], "dtype": "float32"}, {"name": "dense/bias", "shape": [26], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [25, 8], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [4], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [26, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [1, 100], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [25, 100], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [100], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/kernel", "shape": [125, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_2/lstm_cell_2/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/kernel", "shape": [125, 100], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/recurrent_kernel", "shape": [25, 100], "dtype": "float32"}, {"name": "lstm_3/lstm_cell_3/bias", "shape": [100], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}]}